{
  "_meta": {
    "sources": [
      {
        "json": "Addi-4th",
        "abbreviation": "Addi",
        "full": "Addi-4th",
        "authors": [
          "u/YourUsername"
        ],
        "convertedBy": [
          "Ikaguia"
        ],
        "version": "1.0",
        "url": "https://www.reddit.com/r/UnearthedArcana/comments/bha9uj/elven_subrace_ash_elf_a_tough_race_of_greyskinned/",
        "targetSchema": "1.0.0"
      }
    ],
    "dateAdded": 1572295517,
    "dateLastModified": 1729630006,
    "_dateLastModifiedHash": "ac028fe9d4",
    "edition": "classic"
  },
  "name": "Glory Nephilim",
  "source": "Homebrew",
  "type": "race",
  "size": "M",
  "speed": {
    "walk": 30
  },
  "ability": [
    {
      "cha": "+2"
    }
  ],
  "languageProficiencies": [
    "Common",
    "Celestial",
    "Infernal"
  ],
  "resist": [
    "necrotic",
    "radiant"
  ],
  "vision": [
    {
      "type": "darkvision",
      "range": 60
    }
  ],
  "trait": [
    {
      "name": "Celestial Resistance",
      "entries": [
        "You have resistance to necrotic damage and radiant damage."
      ]
    }
  ],
  "subraces": [
    {
      "name": "Celestial Tiefling",
      "source": "Homebrew",
      "ability": [
        {
          "dex": "+2"
        }
      ],
      "type": "fiend",
      "vision": [
        {
          "type": "darkvision",
          "range": 120
        }
      ],
      "trait": [
        {
          "name": "Devil's Eyes",
          "entries": [
            "You have enhanced Darkvision up to 120ft."
          ]
        },
        {
          "name": "Harming Hands",
          "entries": [
            "As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature loses a number of hit points equal to the total rolled. Once you use this trait, you can’t use it again until you finish a long rest."
          ]
        },
        {
          "name": "Chaos Bearer",
          "entries": [
            "You know the _thaumaturgy_ cantrip."
          ]
        },
        {
          "name": "Radiant Soul",
          "entries": [
            "Once per long rest, you can use a bonus action to transform using your revelation which lasts for one minute or until you end it as a bonus action.",
            "You unleash the divine energy within yourself, causing your eyes to glimmer and two luminous, incorporeal wings to sprout from your back. During your transformation, you have a flying speed of 30 feet, and once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra radiant damage equals your level."
          ]
        },
        {
          "name": "Fiendish Legacy",
          "entries": [
            "When hitting Celestial enemies you deal an extra 1d8 damage."
          ]
        }
      ]
    },
    {
      "name": "Fiendish Aasimar",
      "source": "Homebrew",
      "ability": [
        {
          "str": "+2"
        }
      ],
      "type": "celestial",
      "speed": {
        "fly": 60
      },
      "trait": [
        {
          "name": "Healing Hands",
          "entries": [
            "As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can’t use it again until you finish a long rest."
          ]
        },
        {
          "name": "Light Bearer",
          "entries": [
            "You know the _light_ cantrip. Charisma is your spellcasting ability for it."
          ]
        },
        {
          "name": "Radiant Consumption",
          "entries": [
            "Once per long rest, you can use a bonus action to transform using your revelation which lasts for one minute or until you end it as a bonus action.",
            "Searing light temporarily radiates from your eyes and mouth. For the duration, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes radiant damage equal to your proficiency bonus. Until the transformation ends, once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus."
          ]
        },
        {
          "name": "Celestial Legacy",
          "entries": [
            "When hitting Fiendish enemies you deal an extra 1d8 damage."
          ]
        }
      ]
    }
  ],
  "fluff": {
    "entries": [
      "Descendants from the Champions of Ibberath, Uriel & Nemeia, the Glory Nephilim are a race which combines different features from both the Aasimar and Tiefling races.",
      "At 1st level, you choose whether your character is a Fiendish Aasimar or Angelic Tiefling sub-race.",
      {
        "type": "entries",
        "name": "Life Span",
        "entries": [
          "Glory Nephilim mature at the same rate as humans, but they can live somewhere between 500-1000 years."
        ]
      },
      {
        "type": "entries",
        "name": "Height and Weight",
        "entries": [
          "Glory Nephilim have a similar build as humans, but height can vary from 4 to 7 feet."
        ]
      }
    ]
  }
}
